{
    "stories": [
        {
            "title": "The hello world story",
            "description": "\nOnce upon a time - not very long ago - lived a random citizen called Eric. He didn't show interest in anything at all! One day some of his nerdy friends invited him for an event. Actually it was about a technology exhibtion. Would you make Eric go to that event on that day?\n",
            "answers": [
                {
                    "title": "Yes",
                    "description": "\nGreat! On that day you went there with a fresh-looking suite for the sake of your sakes. Although it was not much dull for Eric that day. He found and made many new pals. Also there were some rooms that are open for the exhibition. There were many rooms too!\n",
                    "over": false,
                    "answers": [
                        {
                            "title": "Just stay and chat with your pals",
                            "description": "\nNice chat! But all of your day ended just like that. You feel sleepy now - and of course the exhibition was over. Go to the bed buddy :D\n",
                            "over": true,
                            "win": false
                        },
                        {
                            "title": "Go to the gaming centre",
                            "description": "\nIncredible! You beat many of your friends. But you made one wrong decision. You started betting and returned home with no money ;(\n",
                            "over": true,
                            "win": false
                        },
                        {
                            "title": "Go to the cafe",
                            "description": "\nThe food were delicious! But they were prepared with no hygienic measures. So you had to meet the doctor and do nothing after that. Choose wisely next time!\n",
                            "over": true,
                            "win": false
                        },
                        {
                            "title": "Go to Programmer arcade",
                            "description": "\nYou found that this room is very strange and you want to leave it very soon. But something tell that you stay there. Would you?\n",
                            "over": false,
                            "answers": [
                                {
                                    "title": "Stay here",
                                    "description": "\nIt was very hard to stay there until you heard a description about programming. You feel little interest about it! Then the committe announced that they are giving lessons for novice programmers distributed some applications for the people who would like to join. What would you like to learn?",
                                    "over": false,
                                    "answers": [
                                        {
                                            "title": "Java",
                                            "description": "\nJava runs on more that 3 billion devices - they said. Finally you managed to write your first program. Then you run it with a big hope. And finally it displayed 'hello world' in your console. You gazed at it very happily!",
                                            "over": true,
                                            "win": true
                                        },
                                        {
                                            "title": "Javascript",
                                            "description": "\nYou quickly realised JS is just an awesome language. Finally you managed to write your first program. Then you run it with a big hope. And finally it displayed 'hello world' in your console. You gazed at it very happily!",
                                            "over": true,
                                            "win": true
                                        },
                                        {
                                            "title": "Python",
                                            "description": "\nThe most popular programming language in the world. You wonder how a reptile can change the world :D Finally you managed to write your first program. Then you run it with a big hope. And finally it displayed 'hello world' in your console. You gazed at it very happily!",
                                            "over": true,
                                            "win": true
                                        },
                                        {
                                            "title": "Assembly",
                                            "description": "\nAssembly is like the core of many things - including programming languages and OS. But this is no good for beginners. You fell discouraged and started hating programming :(",
                                            "over": true,
                                            "win": false
                                        },
                                        {
                                            "title": "C++",
                                            "description": "\nIt seems to be hard. But you started loving it! Finally you managed to write your first program. Then you run it with a big hope. And finally it displayed 'hello world' in your console. You gazed at it very happily!",
                                            "over": true,
                                            "win": true
                                        },
                                        {
                                            "title": "Lua",
                                            "description": "\nLua - a small but a powerful language. You quickly got the language. Finally you managed to write your first program. Then you run it with a big hope. And finally it displayed 'hello world' in your console. You gazed at it very happily!",
                                            "over": true,
                                            "win": true
                                        }
                                    ]
                                },
                                {
                                    "title": "Get out soon",
                                    "description": "\nHuh? Bad choice you made. Better luck next time!",
                                    "over": true,
                                    "win": false
                                }
                            ]
                        }
                    ]
                },
                {
                    "title": "No",
                    "description": "\nSleepy monster! Just stay there for your entire life ....",
                    "over": true,
                    "win": false
                }
            ]
        },
        {
            "title": "Haunted Motel",
            "description": "\nIt's summer holidays, your parents decide to go on a roadtrip to the mountains and they want you to join them for some family time.  Would you like to join them or rather go out with your friends? ",
            "answers": [
                {
                    "title": "I'm not gonna go on their silly roadtrip!",
                    "description": "\nYour parents are disappointed that you do not want to spend time with your family. You are grounded!",
                    "over": true,
                    "win": false
                },
                {
                    "title": "Sure! I rather go than be grounded",
                    "over": false,
                    "description": "\nFinally the day came. You went on the dreaded family roadtrip. Your parents car starts to break down in a secluded area late at night. Your only options are to wait 25 hours for the mechanic to get you or drive 1 mile to the nearest motel. What would you do?  ",
                    "answers": [
                        {
                            "title": "Wait 25 hours in the car, I watched too many horror films about motels.",
                            "description": "\nGet cosy! It is going to be a long night with your family.",
                            "over": true,
                            "win": false
                        },
                        {
                            "title": "You convince your parents to drive to the nearest motel for wifi lol.",
                            "description": "\nYou notice weird signs along the drive telling you to turn back, but you ignore them and arrive at the motel. The motel looks desserted. What do you want to do?  ",
                            "over": false,
                            "answers": [
                                {
                                    "title": "Go into the motel",
                                    "over": false,
                                    "description": "\nYou enter the motel, you look around and you see no ones. Your family and you decide to venture into the rooms. You hear a loud scream from your baby sister and you rush over to her to find a decaying dead body on the ground. What do you do?",
                                    "answers": [
                                        {
                                            "title": "Your family freaks out and tries to look for reception to call the police...",
                                            "description": "\nThe police arrive at the location. The police search the area and they dont find the dead body. That is when you realise, your family and you are the only ones that can see the dead man on the ground... ",
                                            "over": true,
                                            "win": false
                                        },
                                        {
                                            "title": "To avoid being accomplices of murder you convince your parents not to call the police.  ",
                                            "description": "\nYou notice two things in the room, a shovel at the corner of the room and a glittering object in the pocket of the dead man. What do you reach for?",
                                            "over": false,
                                            "answers": [
                                                {
                                                    "title": "Shovel",
                                                    "description": "\nYour family and you bury the dead body and attempt to flee the the scene of crime. You turn around and feel a sharp pain on your neck and you drop to the floor gasping for air!",
                                                    "over": true,
                                                    "win": false
                                                },
                                                {
                                                    "title": "Reach for the object",
                                                    "description": "\nYou pull the object from the pocket to realise it is a locket. Out of curiousity, do you wanna open the locket or leave the locket where you found it ?",
                                                    "over": false,
                                                    "answers": [
                                                        {
                                                            "title": "Open",
                                                            "description": "\nA flash of light hits you, and you standing next to your car with your family on the road where your car first broke down. You reach into your pocket to find the locket. Congratulations, your life is now stuck in a time loop until you break free!",
                                                            "over": true,
                                                            "win": true
                                                        },
                                                        {
                                                            "title": "Leave",
                                                            "description": "\nYou have watched too many horror stories, you decide to drop the locket and flee from the motel. Suddenly, all the doors flung shut, the lights start flickering, you turn around and feel a sharp pain on your neck and you drop to the floor gasping for air ",
                                                            "over": true,
                                                            "win": false
                                                        }
                                                    ]
                                                }                                                
                                            ]
                                        },
                                        {
                                            "title": "You forget everything you saw and try to leave the motel immediately!",
                                            "description": "\nAll the doors flung shut, the lights start flickering, you turn around and feel a sharp pain on your neck and you drop to the floor gasping for air!",
                                            "over": true,
                                            "win": false
                                        }
                                    ]    
                                },
                        
                                
                          
                
                                {
                                    "title": "You convince your parents to turn back to the main road as this motel is really creepy.",
                                    "over": true,
                                    "win": false,
                                    "description": "\nYour parents drive out to the main road to wait for the mechanic. However, the wolves got to you before the hypothermia could. Your entire family dies!"
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "title": "The unknown story",
            "description": "Jokes lol no story here!",
            "over": true,
            "win": false
        }
    ],
    "over": false
}